Revit 2027 API
DimensionShape Enumeration
An enumerated type to list dimension type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum DimensionShape
Public Enumeration DimensionShape
public enum class DimensionShape
type DimensionShape
Members
Member name | Value | Description
Angular | 1 |  Angular dimension.
ArcLength | 3 |  ArcLength dimension.
Diameter | 5 |  Diameter dimension.
Linear | 0 |  Linear dimension.
Radial | 2 |  Radial dimension.
Spot | 4 |  Spot dimension.
Unknown | 6 |  Unknown type dimension.
See Also
Reference
Autodesk.Revit.DB Namespace